
## Plan Result

[CI link](https://github.com/marwenbhriz/gsTerraform/actions/runs/9884273108)


<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.address.google_compute_global_address.default
  * module.gcr.google_artifact_registry_repository.benhriz-repo
  * module.hello.null_resource.default
  * module.network.google_compute_network.benhriz-vpc
  * module.network.google_compute_subnetwork.benhriz-subnetwork


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.address.google_compute_global_address.default will be created
  + resource "google_compute_global_address" "default" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "lb-address"
      + prefix_length      = (known after apply)
      + project            = "grasys-study"
      + self_link          = (known after apply)
    }

  # module.gcr.google_artifact_registry_repository.benhriz-repo will be created
  + resource "google_artifact_registry_repository" "benhriz-repo" {
      + create_time      = (known after apply)
      + description      = "benhriz docker repository"
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "asia-northeast1"
      + mode             = "REMOTE_REPOSITORY"
      + name             = (known after apply)
      + project          = "grasys-study"
      + repository_id    = "upstream-repo"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)

      + remote_repository_config {
          + description = "docker hub"

          + docker_repository {
              + public_repository = "DOCKER_HUB"
            }
        }
    }

  # module.hello.null_resource.default will be created
  + resource "null_resource" "default" {
      + id = (known after apply)
    }

  # module.network.google_compute_network.benhriz-vpc will be created
  + resource "google_compute_network" "benhriz-vpc" {
      + auto_create_subnetworks                   = false
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "githubaction-vpc"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + numeric_id                                = (known after apply)
      + project                                   = "grasys-study"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # module.network.google_compute_subnetwork.benhriz-subnetwork will be created
  + resource "google_compute_subnetwork" "benhriz-subnetwork" {
      + creation_timestamp         = (known after apply)
      + description                = "benhriz-subnet-1a"
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.0.1.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "githubaction-subnetwork"
      + network                    = (known after apply)
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "grasys-study"
      + purpose                    = (known after apply)
      + region                     = "asia-northeast1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)

      + log_config {
          + aggregation_interval = "INTERVAL_5_SEC"
          + filter_expr          = "true"
          + flow_sampling        = 0.5
          + metadata             = "INCLUDE_ALL_METADATA"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":16,"Program":"tfcmt","SHA1":"677e7150e4f620dcd2c8b6512966bb764c95538a","Vars":{},"WorkflowName":"terraform plan"} -->